In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
Data = pd.read_excel(r'C:\Users\91895\Downloads\Dataset.xlSX')

In [4]:
Data

,id_bank,specialisation,country,bank_Name,Total_asset_in_million_USD,ROE
0,2,Commercial Banks,BANGLADESH,AB Bank Ltd,3204.829000,7.140000
1,5,Commercial Banks,UNITED ARAB EMIRATES,Abu Dhabi Commercial Bank,55553.300000,19.969999
2,6,Islamic Banks,UNITED ARAB EMIRATES,Abu Dhabi Islamic Bank - Public Joint Stock Co.,30470.742000,23.219999
3,9,Commercial Banks,MALAYSIA,Affin Bank,13829.385000,10.730000
4,10,Islamic Banks,MALAYSIA,Affin Islamic Bank Berhad,3640.429250,9.000000
...,...,...,...,...,...,...
233,343,Commercial Banks,PAKISTAN,United Bank Limited,11063.361000,20.580000
234,344,Commercial Banks,BANGLADESH,United Commercial Bank Ltd,3376.845750,17.290001
235,345,Commercial Banks,MALAYSIA,United Overseas Bank (Malaysia) Bhd.,26903.062000,19.629999
236,346,Commercial Banks,BANGLADESH,Uttara Bank Limited,1786.650125,12.160000
237,349,Commercial Banks,TURKEY,Yapi Ve Kredi Bankasi A.S.,78070.360000,10.220000

In [5]:
Data['specialisation'].unique()

array(['Commercial Banks', 'Islamic Banks'], dtype=object)

In [6]:
Data_Islamic = Data[Data['specialisation'] == 'Islamic Banks']

In [7]:
Data_Islamic.shape

(59, 6)

In [8]:
Data_Islamic['country'].unique()

array(['UNITED ARAB EMIRATES', 'MALAYSIA', 'KUWAIT', 'SAUDI ARABIA',
       'BANGLADESH', 'BAHRAIN', 'PAKISTAN', 'TURKEY', 'INDONESIA',
       'QATAR'], dtype=object)

In [9]:
country = ['UNITED ARAB EMIRATES', 'MALAYSIA', 'KUWAIT', 'SAUDI ARABIA',
       'BANGLADESH', 'BAHRAIN', 'PAKISTAN', 'TURKEY', 'INDONESIA',
       'QATAR']
dict_money_islamic_bank = {}
for i in country:
    sum = Data_Islamic[Data_Islamic['country']==i]['Total_asset_in_million_USD'].sum()
    dict_money_islamic_bank[i] = sum

In [10]:
dict_money_islamic_bank

{'UNITED ARAB EMIRATES': 105206.125,
 'MALAYSIA': 156863.40462500002,
 'KUWAIT': 85687.49999999999,
 'SAUDI ARABIA': 133428.62099999998,
 'BANGLADESH': 19828.953290039062,
 'BAHRAIN': 14883.582374999998,
 'PAKISTAN': 7319.323625,
 'TURKEY': 44839.639500000005,
 'INDONESIA': 14015.46040625,
 'QATAR': 58955.58}

In [11]:
Data_Commercial_Bank = Data[Data['specialisation'] == 'Commercial Banks']

In [12]:
Data_Commercial_Bank

,id_bank,specialisation,country,bank_Name,Total_asset_in_million_USD,ROE
0,2,Commercial Banks,BANGLADESH,AB Bank Ltd,3204.829000,7.140000
1,5,Commercial Banks,UNITED ARAB EMIRATES,Abu Dhabi Commercial Bank,55553.300000,19.969999
3,9,Commercial Banks,MALAYSIA,Affin Bank,13829.385000,10.730000
5,12,Commercial Banks,QATAR,Ahli Bank QSC,8620.989000,15.510000
6,13,Commercial Banks,BAHRAIN,Ahli United Bank BSC,33444.900000,14.680000
...,...,...,...,...,...,...
233,343,Commercial Banks,PAKISTAN,United Bank Limited,11063.361000,20.580000
234,344,Commercial Banks,BANGLADESH,United Commercial Bank Ltd,3376.845750,17.290001
235,345,Commercial Banks,MALAYSIA,United Overseas Bank (Malaysia) Bhd.,26903.062000,19.629999
236,346,Commercial Banks,BANGLADESH,Uttara Bank Limited,1786.650125,12.160000
237,349,Commercial Banks,TURKEY,Yapi Ve Kredi Bankasi A.S.,78070.360000,10.220000

In [13]:
Data_Commercial_Bank['country'].unique()

array(['BANGLADESH', 'UNITED ARAB EMIRATES', 'MALAYSIA', 'QATAR',
       'BAHRAIN', 'TURKEY', 'KUWAIT', 'PAKISTAN', 'SAUDI ARABIA',
       'INDONESIA'], dtype=object)

In [14]:
CountryC = ['BANGLADESH', 'UNITED ARAB EMIRATES', 'MALAYSIA', 'QATAR',
       'BAHRAIN', 'TURKEY', 'KUWAIT', 'PAKISTAN', 'SAUDI ARABIA',
       'INDONESIA']
dict_money_commercial_bank = {}
for i in CountryC:
    sum = Data_Commercial_Bank[Data_Commercial_Bank['country']==i]['Total_asset_in_million_USD'].sum()
    dict_money_commercial_bank[i] = sum

In [15]:
dict_money_commercial_bank

{'BANGLADESH': 54267.9235625,
 'UNITED ARAB EMIRATES': 428259.7312500001,
 'MALAYSIA': 545158.6005625,
 'QATAR': 217316.27800000002,
 'BAHRAIN': 51627.346875,
 'TURKEY': 773895.6575,
 'KUWAIT': 145417.35100000002,
 'PAKISTAN': 98982.7054375,
 'SAUDI ARABIA': 426177.72400000005,
 'INDONESIA': 384063.457546875}

In [16]:
dict_money_islamic_bank

{'UNITED ARAB EMIRATES': 105206.125,
 'MALAYSIA': 156863.40462500002,
 'KUWAIT': 85687.49999999999,
 'SAUDI ARABIA': 133428.62099999998,
 'BANGLADESH': 19828.953290039062,
 'BAHRAIN': 14883.582374999998,
 'PAKISTAN': 7319.323625,
 'TURKEY': 44839.639500000005,
 'INDONESIA': 14015.46040625,
 'QATAR': 58955.58}

In [17]:
Data_Islamic[Data_Islamic['country'] == 'UNITED ARAB EMIRATES' ]['ROE']

2      23.219999
8       6.660000
11      2.260000
102    21.400000
106     8.380000
161    23.719999
211     8.360000
Name: ROE, dtype: float64

In [18]:
Data_Commercial_Bank[Data_Commercial_Bank['country'] == 'UNITED ARAB EMIRATES' ]['ROE']

1      19.969999
28     11.150000
81      6.590000
94      5.810000
95     16.360001
107    14.480000
112    20.209999
131    13.430000
144    15.730000
152    17.379999
154    19.100000
157    22.180000
158     8.350000
231    14.300000
232    22.570000
Name: ROE, dtype: float64

In [19]:
import matplotlib.pyplot as plt

In [24]:
Data_Commercial_Bank.describe()

          id_bank  Total_asset_in_million_USD         ROE
count  179.000000                  179.000000  179.000000
mean   183.351955                17459.032267   11.907151
std    101.235259                27856.571757    6.969964
min      2.000000                  151.149109  -25.830000
25%     95.000000                 1780.794063    8.660000
50%    176.000000                 4076.965750   12.240000
75%    275.000000                17920.027000   15.865000
max    349.000000               133614.488000   29.549999

In [26]:
Data_Islamic.describe()

          id_bank  Total_asset_in_million_USD        ROE
count   59.000000                   59.000000  59.000000
mean   151.932203                10864.884573   9.345254
std    105.045781                14490.189980   8.705430
min      6.000000                   13.285540 -37.959999
25%     43.500000                 2531.677000   5.310000
50%    153.000000                 5678.279000   9.990000
75%    230.000000                12172.901000  14.280000
max    335.000000                82056.432000  23.719999

In [28]:
Data_Islamic.to_csv('Islamic.csv')

In [30]:
Data_Commercial_Bank.to_csv('Commercial.csv')

In [31]:
from sklearn.linear_model import LinearRegression

In [32]:
Linear = LinearRegression()